In [37]:
import numpy as np

In [38]:
np.sum(np.array([1,2,3,4,5,6,7]))

28

In [39]:
from numpy import sum,array

In [40]:
sum(array([1,2,3,5,6,8]))

25

# today agenda

In [ ]:
- pandas
  -> Series
  -> dataframes

In [43]:
import pandas as pd

In [44]:
pd.__version__

'1.1.3'

In [45]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p16', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [36]:
print(len(dir(pd)))

140

In [4]:
import pandas as pd
import numpy as np

In [6]:
mydata=np.arange(30,100)
print(mydata)

[30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53
 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77
 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99]

In [25]:
mydata=np.arange(30,100,10)
print(mydata)

[30 40 50 60 70 80 90]

In [26]:
mypop_data=pd.Series(mydata)
print(mypop_data)

0    30
1    40
2    50
3    60
4    70
5    80
6    90
dtype: int32

In [32]:
mypop_data.name="population"

In [33]:
mypop_data[0]

30

In [34]:
mypop_data.name

'population'

In [27]:
g7_pop=pd.Series([11.23,44.56,77.88,99.44,66.55,76.45])

In [28]:
type(g7_pop.values)

numpy.ndarray

In [29]:
g7_pop.index

RangeIndex(start=0, stop=6, step=1)

In [1]:
import pandas as pd
import numpy as np

In [60]:
r=pd.Series(np.array([1,2,3,4,5,6]))

In [61]:
r

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

In [54]:
r=pd.Series(np.array([1,2,3,4,5,6]),index=['a','b','c','d','e','f'])

In [55]:
r

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int32

In [ ]:
help()

In [4]:
r=pd.Series(np.array([1,2,3,4,5,6]),index=['a','b','c','d','e','f'],name='roll no',dtype='float')

In [5]:
r

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    6.0
Name: roll no, dtype: float64

In [8]:
d={'vidya':85,'poojitha':87,'hansika':90,'jyo':99}
d.keys()

dict_keys(['vidya', 'poojitha', 'hansika', 'jyo'])

In [9]:
d.values()

dict_values([85, 87, 90, 99])

In [10]:
d.items()

dict_items([('vidya', 85), ('poojitha', 87), ('hansika', 90), ('jyo', 99)])

In [11]:
marks=pd.Series(d)
print(marks)

vidya       85
poojitha    87
hansika     90
jyo         99
dtype: int64

In [13]:
marks=pd.Series(d,name='s marks',dtype='str')
print(marks)

vidya       85
poojitha    87
hansika     90
jyo         99
Name: s marks, dtype: object

In [15]:
marks[['vidya','hansika','poojitha']]

vidya       85
hansika     90
poojitha    87
Name: s marks, dtype: object

In [16]:
marks['vidya':'jyo']

vidya       85
poojitha    87
hansika     90
jyo         99
Name: s marks, dtype: object

In [21]:
# iloc-it defines index values
# loc- it defines index positions
marks.iloc[0]

'85'

In [22]:
marks.loc['poojitha']

'87'

In [23]:
marks.iloc[0:4]

vidya       85
poojitha    87
hansika     90
jyo         99
Name: s marks, dtype: object

In [24]:
import random

In [25]:
random.randint(1,20)

19

# operators

In [29]:
a=pd.Series(np.array([1,2,7,8,3,9,7,8]),index=list('abcdefgh'),name='grades')
a

a    1
b    2
c    7
d    8
e    3
f    9
g    7
h    8
Name: grades, dtype: int32

In [30]:
a > 6

a    False
b    False
c     True
d     True
e    False
f     True
g     True
h     True
Name: grades, dtype: bool

In [33]:
a[a > 7]

d    8
f    9
h    8
Name: grades, dtype: int32

In [34]:
a*13

a     13
b     26
c     91
d    104
e     39
f    117
g     91
h    104
Name: grades, dtype: int32

# statistical operations

In [35]:
a.mean()

5.625

In [37]:
a['a':'d'].mean()

4.5

In [38]:
(9+7+6)/3

7.333333333333333

In [41]:
a['a']=23
a

a    23
b     2
c     7
d     8
e     3
f     9
g     7
h     8
Name: grades, dtype: int32

In [50]:
ms_marks={'sub1':[45,100,89,56,86,83,82,33,78,91],
         'sub2':[76,100,92,23,54,90,80,70,60,100],
         'sub3':[56,100,93,56,24,86,95,85,94,84],
         'sub4':[45,100,86,96,97,15,99,45,76,86]}

In [71]:
marks=pd.DataFrame(ms_marks,index=['vidya','pooji','hans','jyo','ush','aish','janu','priya','vinee','prav'])
marks

       sub1  sub2  sub3  sub4
vidya    45    76    56    45
pooji   100   100   100   100
hans     89    92    93    86
jyo      56    23    56    96
ush      86    54    24    97
aish     83    90    86    15
janu     82    80    95    99
priya    33    70    85    45
vinee    78    60    94    76
prav     91   100    84    86

In [72]:
marks.loc['vidya']

sub1    45
sub2    76
sub3    56
sub4    45
Name: vidya, dtype: int64

In [73]:
marks.loc[['vidya','jyo']]

       sub1  sub2  sub3  sub4
vidya    45    76    56    45
jyo      56    23    56    96

In [59]:
marks.loc['vidya'].sum()

222

In [60]:
marks.loc[['vidya','jyo']].sum()

sub1    101
sub2     99
sub3    112
sub4    141
dtype: int64

In [74]:
marks.columns

Index(['sub1', 'sub2', 'sub3', 'sub4'], dtype='object')

In [75]:
marks.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, vidya to prav
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sub1    10 non-null     int64
 1   sub2    10 non-null     int64
 2   sub3    10 non-null     int64
 3   sub4    10 non-null     int64
dtypes: int64(4)
memory usage: 720.0+ bytes

In [76]:
marks.size

40

In [77]:
marks.shape

(10, 4)

In [78]:
marks.describe

<bound method NDFrame.describe of        sub1  sub2  sub3  sub4
vidya    45    76    56    45
pooji   100   100   100   100
hans     89    92    93    86
jyo      56    23    56    96
ush      86    54    24    97
aish     83    90    86    15
janu     82    80    95    99
priya    33    70    85    45
vinee    78    60    94    76
prav     91   100    84    86>

In [79]:
marks.describe()

             sub1        sub2        sub3        sub4
count   10.000000   10.000000   10.000000   10.000000
mean    74.300000   74.500000   77.300000   74.500000
std     21.959812   23.996528   24.226019   29.375916
min     33.000000   23.000000   24.000000   15.000000
25%     61.500000   62.500000   63.000000   52.750000
50%     82.500000   78.000000   85.500000   86.000000
75%     88.250000   91.500000   93.750000   96.750000
max    100.000000  100.000000  100.000000  100.000000

In [80]:
marks['sub1']

vidya     45
pooji    100
hans      89
jyo       56
ush       86
aish      83
janu      82
priya     33
vinee     78
prav      91
Name: sub1, dtype: int64

In [81]:
marks[['sub1','sub4']]

       sub1  sub4
vidya    45    45
pooji   100   100
hans     89    86
jyo      56    96
ush      86    97
aish     83    15
janu     82    99
priya    33    45
vinee    78    76
prav     91    86

In [87]:
marks > 70

        sub1   sub2   sub3   sub4
vidya  False   True  False  False
pooji   True   True   True   True
hans    True   True   True   True
jyo    False  False  False   True
ush     True  False  False   True
aish    True   True   True  False
janu    True   True   True   True
priya  False  False   True  False
vinee   True  False   True   True
prav    True   True   True   True

In [85]:
marks > 70
marks.index

Index(['vidya', 'pooji', 'hans', 'jyo', 'ush', 'aish', 'janu', 'priya',
       'vinee', 'prav'],
      dtype='object')

In [86]:
marks[marks > 70]

        sub1   sub2   sub3   sub4
vidya    NaN   76.0    NaN    NaN
pooji  100.0  100.0  100.0  100.0
hans    89.0   92.0   93.0   86.0
jyo      NaN    NaN    NaN   96.0
ush     86.0    NaN    NaN   97.0
aish    83.0   90.0   86.0    NaN
janu    82.0   80.0   95.0   99.0
priya    NaN    NaN   85.0    NaN
vinee   78.0    NaN   94.0   76.0
prav    91.0  100.0   84.0   86.0

In [92]:
marks.sub1['jyo']

56

In [93]:
marks.iloc[0][0:3]

sub1    45
sub2    76
sub3    56
Name: vidya, dtype: int64

In [94]:
marks.iloc[7]

sub1    33
sub2    70
sub3    85
sub4    45
Name: priya, dtype: int64

In [95]:
marks.iloc[5][0]

83

In [96]:
marks.iloc[8][0:4]

sub1    78
sub2    60
sub3    94
sub4    76
Name: vinee, dtype: int64

In [97]:
marks.iloc[9][3]

86

In [104]:
marks['sub5']=[82,28,33,49,58,63,78,81,97,12]

In [105]:
marks

       sub1  sub2  sub3  sub4  sub5
vidya    45    76    56    45    82
pooji   100   100   100   100    28
hans     89    92    93    86    33
jyo      56    23    56    96    49
ush      86    54    24    97    58
aish     83    90    86    15    63
janu     82    80    95    99    78
priya    33    70    85    45    81
vinee    78    60    94    76    97
prav     91   100    84    86    12

# how to drop columns

In [106]:
# how to drop columns
marks.drop(columns='sub5')

       sub1  sub2  sub3  sub4
vidya    45    76    56    45
pooji   100   100   100   100
hans     89    92    93    86
jyo      56    23    56    96
ush      86    54    24    97
aish     83    90    86    15
janu     82    80    95    99
priya    33    70    85    45
vinee    78    60    94    76
prav     91   100    84    86

In [107]:
marks.drop(columns=['sub5','sub3'])

       sub1  sub2  sub4
vidya    45    76    45
pooji   100   100   100
hans     89    92    86
jyo      56    23    96
ush      86    54    97
aish     83    90    15
janu     82    80    99
priya    33    70    45
vinee    78    60    76
prav     91   100    86

In [108]:
marks

       sub1  sub2  sub3  sub4  sub5
vidya    45    76    56    45    82
pooji   100   100   100   100    28
hans     89    92    93    86    33
jyo      56    23    56    96    49
ush      86    54    24    97    58
aish     83    90    86    15    63
janu     82    80    95    99    78
priya    33    70    85    45    81
vinee    78    60    94    76    97
prav     91   100    84    86    12

In [110]:
marks.drop(columns='sub5',axis=1)

       sub1  sub2  sub3  sub4
vidya    45    76    56    45
pooji   100   100   100   100
hans     89    92    93    86
jyo      56    23    56    96
ush      86    54    24    97
aish     83    90    86    15
janu     82    80    95    99
priya    33    70    85    45
vinee    78    60    94    76
prav     91   100    84    86

In [111]:
marks

       sub1  sub2  sub3  sub4  sub5
vidya    45    76    56    45    82
pooji   100   100   100   100    28
hans     89    92    93    86    33
jyo      56    23    56    96    49
ush      86    54    24    97    58
aish     83    90    86    15    63
janu     82    80    95    99    78
priya    33    70    85    45    81
vinee    78    60    94    76    97
prav     91   100    84    86    12

In [112]:
marks.drop(columns='sub5',axis=2)

       sub1  sub2  sub3  sub4
vidya    45    76    56    45
pooji   100   100   100   100
hans     89    92    93    86
jyo      56    23    56    96
ush      86    54    24    97
aish     83    90    86    15
janu     82    80    95    99
priya    33    70    85    45
vinee    78    60    94    76
prav     91   100    84    86

# delete permanantly

In [113]:
marks.drop(columns='sub5',axis=1,inplace=True)

In [114]:
marks

       sub1  sub2  sub3  sub4
vidya    45    76    56    45
pooji   100   100   100   100
hans     89    92    93    86
jyo      56    23    56    96
ush      86    54    24    97
aish     83    90    86    15
janu     82    80    95    99
priya    33    70    85    45
vinee    78    60    94    76
prav     91   100    84    86

In [120]:
marks.drop('priya')

       sub1  sub2  sub3  sub4
vidya    45    76    56    45
pooji   100   100   100   100
hans     89    92    93    86
jyo      56    23    56    96
ush      86    54    24    97
aish     83    90    86    15
janu     82    80    95    99
vinee    78    60    94    76
prav     91   100    84    86

In [121]:
marks.iloc[6][1]=67

In [122]:
marks

       sub1  sub2  sub3  sub4
vidya    45    76    56    45
pooji   100   100   100   100
hans     89    92    93    86
jyo      56    23    56    96
ush      86    54    24    97
aish     83    90    86    15
janu     82    67    95    99
priya    33    70    85    45
vinee    78    60    94    76
prav     91   100    84    86

In [123]:
marks.sub3[0:10]=100

In [124]:
marks

       sub1  sub2  sub3  sub4
vidya    45    76   100    45
pooji   100   100   100   100
hans     89    92   100    86
jyo      56    23   100    96
ush      86    54   100    97
aish     83    90   100    15
janu     82    67   100    99
priya    33    70   100    45
vinee    78    60   100    76
prav     91   100   100    86

In [126]:
marks.iloc['sub1']:100

In [127]:
marks

       sub1  sub2  sub3  sub4
vidya    45    76   100    45
pooji   100   100   100   100
hans     89    92   100    86
jyo      56    23   100    96
ush      86    54   100    97
aish     83    90   100    15
janu     82    67   100    99
priya    33    70   100    45
vinee    78    60   100    76
prav     91   100   100    86

In [128]:
marks.iloc[:][:]=100

In [129]:
marks

       sub1  sub2  sub3  sub4
vidya   100   100   100   100
pooji   100   100   100   100
hans    100   100   100   100
jyo     100   100   100   100
ush     100   100   100   100
aish    100   100   100   100
janu    100   100   100   100
priya   100   100   100   100
vinee   100   100   100   100
prav    100   100   100   100

In [130]:
marks.iloc[:][3]=100

In [131]:
marks

       sub1  sub2  sub3  sub4
vidya   100   100   100   100
pooji   100   100   100   100
hans    100   100   100   100
jyo     100   100   100   100
ush     100   100   100   100
aish    100   100   100   100
janu    100   100   100   100
priya   100   100   100   100
vinee   100   100   100   100
prav    100   100   100   100

In [132]:
marks.iloc[:][5]=90

In [133]:
marks

       sub1  sub2  sub3  sub4
vidya   100   100   100   100
pooji   100   100   100   100
hans    100   100   100   100
jyo     100   100   100   100
ush     100   100   100   100
aish    100   100   100   100
janu    100   100   100   100
priya   100   100   100   100
vinee   100   100   100   100
prav    100   100   100   100

In [134]:
import pandas as pd

#### real csv data from external files using read_csv function

In [135]:
pop_data=pd.read_csv('population.csv')

In [136]:
pop_data

    2001   2002  2003  2004  2005   2006  2007  2008  2009  2010
0     91   91.5    90    95  92.0   96.0    65    97    32  55.4
1    120  140.0   155   146  14.5  555.2   554    54   333  74.0
2     91   91.5    90    95  92.0   96.0    65    97    32  55.8
3    120  140.0   155   146  14.5  555.2   554    54   333  74.0
4     91   91.5    90    95  92.0   96.0    65    97    32  55.8
5    120  140.0   155   146  14.5  555.2   554    54   333  74.0
6     91   91.5    90    95  92.0   96.0    65    96    32  55.8
7    120  140.0   155   146  14.5   55.2   554    54   333  74.0
8     91   91.5    90    95  92.0   96.0    66    97    32  55.8
9    120  140.0   155   146  14.5  555.2   554    54   333  74.0
10    91   91.5    90    95  92.0   96.0    65    97    32  55.8

In [137]:
pop_data.index

RangeIndex(start=0, stop=11, step=1)

In [138]:
pop_data.columns

Index(['2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009',
       '2010'],
      dtype='object')

In [141]:
pop_data.info

<bound method DataFrame.info of     2001   2002  2003  2004  2005   2006  2007  2008  2009  2010
0     91   91.5    90    95  92.0   96.0    65    97    32  55.4
1    120  140.0   155   146  14.5  555.2   554    54   333  74.0
2     91   91.5    90    95  92.0   96.0    65    97    32  55.8
3    120  140.0   155   146  14.5  555.2   554    54   333  74.0
4     91   91.5    90    95  92.0   96.0    65    97    32  55.8
5    120  140.0   155   146  14.5  555.2   554    54   333  74.0
6     91   91.5    90    95  92.0   96.0    65    96    32  55.8
7    120  140.0   155   146  14.5   55.2   554    54   333  74.0
8     91   91.5    90    95  92.0   96.0    66    97    32  55.8
9    120  140.0   155   146  14.5  555.2   554    54   333  74.0
10    91   91.5    90    95  92.0   96.0    65    97    32  55.8>

In [140]:
pop_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   2001    11 non-null     int64
 1   2002    11 non-null     float64
 2   2003    11 non-null     int64
 3   2004    11 non-null     int64
 4   2005    11 non-null     float64
 5   2006    11 non-null     float64
 6   2007    11 non-null     int64
 7   2008    11 non-null     int64
 8   2009    11 non-null     int64
 9   2010    11 non-null     float64
dtypes: float64(4), int64(6)
memory usage: 1008.0 bytes

In [146]:
pop_data.index=['india','chaina','england','australia','sk','nk','pak','ban','japan','america','paris']

In [147]:
pop_data

           2001   2002  2003  2004  2005   2006  2007  2008  2009  2010
india        91   91.5    90    95  92.0   96.0    65    97    32  55.4
chaina      120  140.0   155   146  14.5  555.2   554    54   333  74.0
england      91   91.5    90    95  92.0   96.0    65    97    32  55.8
australia   120  140.0   155   146  14.5  555.2   554    54   333  74.0
sk           91   91.5    90    95  92.0   96.0    65    97    32  55.8
nk          120  140.0   155   146  14.5  555.2   554    54   333  74.0
pak          91   91.5    90    95  92.0   96.0    65    96    32  55.8
ban         120  140.0   155   146  14.5   55.2   554    54   333  74.0
japan        91   91.5    90    95  92.0   96.0    66    97    32  55.8
america     120  140.0   155   146  14.5  555.2   554    54   333  74.0
paris        91   91.5    90    95  92.0   96.0    65    97    32  55.8

In [151]:
book1=pd.read_excel('book1.xlsx')

In [152]:
book1

   Unnamed: 0  ms  gcc  is  mad  sa  spm
0         NaN  77   45  22   56  10   90
1         NaN  66   65  44   76  20   80
2         NaN  99   76  66   22  30   70
3         NaN  98   84  33   56  40   60
4         NaN  22   54  34   77  50   50
5         NaN  88   34  55   99  60   40
6         NaN  77   76  67   56  70   30
7         NaN  66   56  54   66  80   20
8         NaN  55   34  87   34  90   10
9         NaN  44   98  76   87  98   34

In [155]:
book1=pd.read_excel('book1.xlsx')

In [156]:
book1

   sl.no  ms  gcc  is  mad  sa  spm
0      1  77   45  22   56  10   90
1      2  66   65  44   76  20   80
2      3  99   76  66   22  30   70
3      4  98   84  33   56  40   60
4      5  22   54  34   77  50   50
5      6  88   34  55   99  60   40
6      7  77   76  67   56  70   30
7      8  66   56  54   66  80   20
8      9  55   34  87   34  90   10
9     10  44   98  76   87  98   34